In [97]:
import pandas as pd

data = pd.read_csv('adult.data.csv')

data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [98]:
race_count = data.value_counts('race')

race_count

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
dtype: int64

In [99]:
race_count['Black']

3124

In [100]:
avg_age_m = data[data['sex']=='Male']['age'].mean()

avg_age_m = round(avg_age_m,1)
avg_age_m

39.4

In [101]:
avg_age_m = round(data[data['sex']=='Male']['age'].mean(),1)
avg_age_m

39.4

In [102]:
ed_percent = round(data['education'].value_counts(normalize=True) * 100,1)
bachlors = ed_percent['Bachelors']

ed_percent

HS-grad         32.3
Some-college    22.4
Bachelors       16.4
Masters          5.3
Assoc-voc        4.2
11th             3.6
Assoc-acdm       3.3
10th             2.9
7th-8th          2.0
Prof-school      1.8
9th              1.6
12th             1.3
Doctorate        1.3
5th-6th          1.0
1st-4th          0.5
Preschool        0.2
Name: education, dtype: float64

In [103]:
adv_degree = ['Bachelors','Masters','Doctorate']

perc_adv_degree = round(ed_percent[adv_degree].sum(),1)

perc_adv_degree

23.0

In [104]:
perc_no_adv_degree = 100 - perc_adv_degree
perc_no_adv_degree

77.0

In [105]:
adv_degree = ['Bachelors','Masters','Doctorate']
data['higher_ed'] = data['education'].isin(adv_degree)
pd.crosstab(data['higher_ed'],data['salary'])

salary     <=50K  >50K
higher_ed
False      20715  4355
True        4005  3486

In [106]:
adv_degree = ['Bachelors','Masters','Doctorate']
data['higher_ed'] = data['education'].isin(adv_degree)
sal_ed_t = pd.crosstab(data['higher_ed'],data['salary'],normalize='index')*100
sal_ed_t

salary         <=50K       >50K
higher_ed
False      82.628640  17.371360
True       53.464157  46.535843

In [107]:
round(sal_ed_t.loc[True,'>50K'],1)

46.5

In [108]:
round(sal_ed_t.loc[False,'>50K'],1)

17.4

In [115]:
data['min_hr_worked'] = data['hours-per-week']==1
min_hrs_salary_table = pd.crosstab(data['min_hr_worked'],data['salary'],normalize='index')
min_hrs_salary_table

salary            <=50K      >50K
min_hr_worked
False          0.759104  0.240896
True           0.900000  0.100000

In [ ]:
min_hrs_count =

In [110]:
min_hrs_wealthy = min_hrs_salary_table.loc[True,'>50K']
min_hrs_wealthy

10.0

In [121]:
hr_per_week = data['hours-per-week'].value_counts().sort_index()
hr_per_week.iloc[0]

20

In [112]:
min_weekly_hours = min(data['hours-per-week'])

min_weekly_hours

1

In [113]:
data

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,higher_ed,min_hr_worked
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,True,False
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,True,False
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,False,False
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,False,False
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K,False,False
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K,False,False
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K,False,False
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K,False,False
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K,False,False